# CLI tools
brew "bat" # 'cat' replacement
brew "chamber" # Secret management; unofficial formula via Homebrew per docs
#brew "colima" # TUI docker desktop
brew "docker"
brew "eza" # 'ls' replacement
brew "zoxide" # 'cd' replacement
brew "fzf" # Fuzzy finder
brew "gdu" # 'du' replacement
brew "gh" # Github CLI
brew "lazygit" # TUI git
brew "neovim" # 'vim' replacement
brew "ripgrep" # 'grep' replacement
brew "starship" # Prompt manager
brew "tree" # Directory listing
brew "wget2" # 'wget' replacement
brew "jq"
brew "go"

# GUI apps
cask "alt-tab" # Windows alt-tab for macOS
cask "flameshot"  # Screenshots
#cask "iterm2" # 'Terminal' replacement; download via 'Self-Service'
cask "linearmouse" # Mouse improvement
cask "amethyst" # Window management
#cask "rectangle" # Window management
#alt wm 'loop' 'swish' 'amethyst'
#cask "visual-studio-code"
