# CLI tools
brew "bat" # 'cat' replacement
brew "chamber" # Secret management; unofficial formula via Homebrew per docs
#brew "colima" # TUI docker desktop
brew "docker"
brew "eza" # 'ls' replacement
brew "zoxide" # 'cd' replacement
brew "fzf" # Fuzzy finder
brew "gdu" # 'du' replacement
brew "gh" # Github CLI
brew "lazygit" # TUI git
brew "neovim" # 'vim' replacement
brew "ripgrep" # 'grep' replacement
brew "fd" # 'find' replacement
brew "starship" # Prompt manager
brew "tree" # Directory listing
brew "wget2" # 'wget' replacement
brew "jq"
brew "go"
brew "tfenv"
brew "pipx"
brew "pyenv"
brew "k6"
brew "pgcli" # CLI for Postgres
brew "d2" # diagrams
brew "task" # TaskWarrior

# GUI apps
cask "alt-tab" # Windows alt-tab for macOS
cask "flameshot"  # Screenshots
#cask "iterm2" # 'Terminal' replacement; download via 'Self-Service'
cask "linearmouse" # Mouse improvement
cask "amethyst" # Tiling Window management
#cask "visual-studio-code"
#cask "kitty" # 'Terminal' replacement; download from script on website
cask "ghostty" # Another 'Terminal' replacement; low expectations
cask "homerow" # VIM-like keys for all MacOS windws
